---
kind: method
id: M:Autodesk.Revit.DB.ColorWithTransparency.#ctor(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
source: html/65910f63-bfc6-a6e4-c689-6da6673c0ad7.htm
---
# Autodesk.Revit.DB.ColorWithTransparency.#ctor Method

color

## Syntax (C#)
```csharp
public ColorWithTransparency(
	uint red,
	uint green,
	uint blue,
	uint transparency
)
```

## Parameters
- **red** (`System.UInt32`) - red
- **green** (`System.UInt32`) - green
- **blue** (`System.UInt32`) - blue
- **transparency** (`System.UInt32`) - transparency

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The value is not valid. The valid range is 0 to 255.